{
  "facts": [
    {
      "id": "F001",
      "text": "Пользователи жалуются на медленную работу системы в течение всего рабочего дня."
    },
    {
      "id": "F002",
      "text": "Пользователи жалуются на медленную работу системы только в часы пик."
    },
    {
      "id": "F003",
      "text": "Пользователи сообщают, что иногда система резко зависает или «подвисает» на короткое время."
    },
    {
      "id": "F004",
      "text": "Долго открываются формы документов реализации товаров."
    },
    {
      "id": "F005",
      "text": "Долго открываются формы документов поступления товаров."
    },
    {
      "id": "F006",
      "text": "Долго открываются формы справочников номенклатуры и контрагентов."
    },
    {
      "id": "F007",
      "text": "Долго формируются типовые управленческие отчеты."
    },
    {
      "id": "F008",
      "text": "Долго формируются регламентированные бухгалтерские отчеты."
    },
    {
      "id": "F009",
      "text": "Проведение документа реализации занимает более десяти секунд."
    },
    {
      "id": "F010",
      "text": "Проведение документа поступления занимает более десяти секунд."
    },
    {
      "id": "F011",
      "text": "Одновременно в системе работает более пятидесяти пользователей."
    },
    {
      "id": "F012",
      "text": "Одновременно в системе работает менее десяти пользователей."
    },
    {
      "id": "F013",
      "text": "Сервер 1С показывает высокую загрузку процессора более восьмидесяти процентов в течение длительного времени."
    },
    {
      "id": "F014",
      "text": "Сервер СУБД показывает высокую загрузку процессора более восьмидесяти процентов в течение длительного времени."
    },
    {
      "id": "F015",
      "text": "Сервер СУБД показывает высокую загрузку дисковой подсистемы в течение длительного времени."
    },
    {
      "id": "F016",
      "text": "В мониторинге СУБД видно большое количество ожидающих блокировок."
    },
    {
      "id": "F017",
      "text": "В журнале регистрации часто фиксируется превышение времени ожидания блокировки."
    },
    {
      "id": "F018",
      "text": "В журнале регистрации много записей с длительностью выполнения операций более пяти секунд."
    },
    {
      "id": "F019",
      "text": "Профилировщик показывает длительные операции чтения из регистра накопления Продажи."
    },
    {
      "id": "F020",
      "text": "Профилировщик показывает длительные операции записи в регистр накопления ОстаткиТоваров."
    },
    {
      "id": "F021",
      "text": "Информационная база работает в файловом варианте."
    },
    {
      "id": "F022",
      "text": "Информационная база работает в клиент серверном варианте."
    },
    {
      "id": "F023",
      "text": "Для информационной базы используется СУБД Microsoft SQL Server."
    },
    {
      "id": "F024",
      "text": "Для информационной базы используется СУБД PostgreSQL."
    },
    {
      "id": "F025",
      "text": "Сервер приложений 1С и сервер СУБД расположены на одном физическом сервере."
    },
    {
      "id": "F026",
      "text": "Сервер приложений 1С и сервер СУБД расположены на разных физических серверах."
    },
    {
      "id": "F027",
      "text": "Большинство пользователей работает в толстом клиенте."
    },
    {
      "id": "F028",
      "text": "Большинство пользователей работает в тонком клиенте."
    },
    {
      "id": "F029",
      "text": "В конфигурации активно используются регистры накопления с большими объемами данных."
    },
    {
      "id": "F030",
      "text": "В конфигурации нет регулярного архивирования и удаления устаревших данных."
    },
    {
      "id": "F031",
      "text": "В конфигурации отчеты активно используют виртуальные таблицы ОстаткиИОбороты."
    },
    {
      "id": "F032",
      "text": "В запросах отчетов часто используются условия по неиндексируемым реквизитам."
    },
    {
      "id": "F033",
      "text": "Документы конфигурации проводят много движений по нескольким регистрам."
    },
    {
      "id": "F034",
      "text": "В формах проведения документов используются управляемые блокировки ДляИзменения на больших выборках данных."
    },
    {
      "id": "F035",
      "text": "В коде конфигурации часто используются запросы без ограничения периода по дате."
    },
    {
      "id": "F036",
      "text": "В профилировщике видно многократные длительные вызовы одного и того же запроса."
    },
    {
      "id": "F037",
      "text": "В профилировщике видно длительные вызовы процедур проведения документов реализации."
    },
    {
      "id": "F038",
      "text": "В профилировщике видно длительные вызовы процедур проведения документов поступления."
    },
    {
      "id": "F039",
      "text": "Основное время выполнения в системе занимает фоновое задание обмена с сайтом."
    },
    {
      "id": "F040",
      "text": "Регламентные задания выполняются в рабочее время и занимают много ресурсов."
    },
    {
      "id": "F041",
      "text": "В системе настроено несколько обменов с внешними системами, выполняющихся в рабочее время."
    },
    {
      "id": "F042",
      "text": "В журнале регистрации много ошибок, связанных с недостатком памяти."
    },
    {
      "id": "F043",
      "text": "На сервере 1С установлено недостаточное количество оперативной памяти."
    },
    {
      "id": "F044",
      "text": "На сервере СУБД установлено недостаточное количество оперативной памяти."
    },
    {
      "id": "F045",
      "text": "На сервере 1С и на сервере СУБД установлены медленные жесткие диски или медленная дисковая подсистема."
    },
    {
      "id": "F046",
      "text": "Наблюдается общая деградация производительности при росте числа пользователей."
    },
    {
      "id": "F047",
      "text": "Наблюдается деградация производительности даже при малом числе пользователей."
    },
    {
      "id": "F048",
      "text": "Узкое место похоже связано с работой сервера приложений 1С."
    },
    {
      "id": "F049",
      "text": "Узкое место похоже связано с работой сервера СУБД."
    },
    {
      "id": "F050",
      "text": "Узкое место похоже связано с блокировками данных."
    },
    {
      "id": "F051",
      "text": "Узкое место похоже связано с дисковой подсистемой."
    },
    {
      "id": "F052",
      "text": "Узкое место похоже связано с архитектурой конфигурации и используемых запросов."
    },
    {
      "id": "F053",
      "text": "Заключение: вероятной причиной являются неоптимизированные запросы к регистрам накопления."
    },
    {
      "id": "F054",
      "text": "Заключение: вероятной причиной является отсутствие необходимых индексов в СУБД."
    },
    {
      "id": "F055",
      "text": "Заключение: вероятной причиной являются лишние движения документов по регистрам."
    },
    {
      "id": "F056",
      "text": "Заключение: вероятной причиной являются конфликты регламентных заданий и обменов с интерактивной работой пользователей."
    },
    {
      "id": "F057",
      "text": "Заключение: вероятной причиной являются недостаточные аппаратные ресурсы серверов."
    },
    {
      "id": "F058",
      "text": "Рекомендация: провести профилирование и детальный анализ проблемных запросов."
    },
    {
      "id": "F059",
      "text": "Рекомендация: оптимизировать структуру регистров, запросов и добавить недостающие индексы."
    },
    {
      "id": "F060",
      "text": "Рекомендация: внедрить архивирование данных и разделение нагрузок по времени."
    }
  ]
}
